{
    "common": {
        "author": "Максим Колдун"
    },
    "HomePage": {
        "test": "test",
        "title": "Привіт, я<br></br>Максим Колдун.",
        "subtitle": "Фронтенд-розробник з України, захоплений створенням доступних та зручних для користувача вебсайтів.",
        "contactme": "Зв'язатися зі мною",
        "featuredProjects": {
            "title": "Вибрані проєкти",
            "subtitle": "Ось деякі з моїх проєктів, які найкраще демонструють мій досвід у фронтенд-розробці.",
            "projectInfo": "Інформація про проєкт",
            "technologies": "Технології",
            "responsibilies": "Обов'язки",
            "keyFeatures": "Особливості",
            "view": "Переглянути"
        },
        "aboutme": {
            "title": "Про мене",
            "subtitle": "Я фронтенд-розробник з більш ніж шістьма роками досвіду.",
            "description": "Я фронтенд-розробник з більш ніж шістьма роками досвіду. Я пишу код, дотримуючись принципів SOLID. Я використовую ООП у проектах на React/Next.js, щоб максимально пов'язати свій код з предметною областю. Також у моїх додатках завжди використовується список патернів, таких як Factory, Strategy та Singleton. Мені подобаються патерни, і я намагаюся використовувати їх де це можливо. Я маю досвід естімейту довгострокових ІТ-проектів. Мій рівень англійської мови дозволяє мені ефективно спілкуватися з іноземними клієнтами. Я розробляю проєкти переважно на React/Redux/Next.js, а також маю досвід роботи з Node js (Express/Sequelize/MySQL). Мій код тестується за допомогою бібліотек, таких як Jest, Enzyme та react-testing-library. Я можу налаштовувати Docker та CI/CD для прокєті для розгортання додатка на сервері. Я командний гравець і зазвичай працюю за методологією Agile в командах, що включали до п'ятнадцяти осіб."
        },
        "connect": {
            "title": "Зв'язатися зі мною",
            "subtitle1": "Моя пошта koldun.maks@gmail.com",
            "subtitle2": "Більше інформації тут, у моєму резюме"
        }
    }
}